luc-github/ESP3D/esp8266/webinterface.cpp
	//Subnet for static IP
	if (!CONFIG::read_buffer(EP_MASK_VALUE,(byte *)sbuf , IP_LENGH) )
		strcpy(msk_buf,wifi_config.ip2str((byte *)DEFAULT_MASK_VALUE));
	else
		strcpy(msk_buf,wifi_config.ip2str((byte *)sbuf));  
	}
  
  
  //display page
  if (wifi_get_opmode()==WIFI_STA ) stmp=wifi_config.ip2str(WiFi.localIP());
  else stmp=wifi_config.ip2str(WiFi.softAPIP());
  if (wifi_config.iweb_port!=80)
	{
		stmp+=":";
		stmp+=String(wifi_config.iweb_port);
	}
  buffer2send+=(PROGMEM2CHAR(PAGE_HEAD_1));
  buffer2send+=(PROGMEM2CHAR(PAGE_HEAD_2));
  TOPBAR(stmp.c_str(),4)
  buffer2send+=(PROGMEM2CHAR(PANEL_TOP));
  buffer2send+=(PROGMEM2CHAR(STATION_TITLE));
  buffer2send+=(PROGMEM2CHAR(PANEL_START));
  buffer2send+=(PROGMEM2CHAR(FORM_START));
  
   //if in AP mode switch to mixed mode to be able to scan
  if (wifi_get_opmode()!=WIFI_STA )
	{
		WiFi.mode(WIFI_AP_STA);
		revertSTA=true;
	}
	
  int n = WiFi.scanNetworks();
  buffer2send+=(PROGMEM2CHAR(TABLE_START));
  buffer2send+=(PROGMEM2CHAR(CAPTION_S));
  buffer2send+=(String(n).c_str());
  buffer2send+=(PROGMEM2CHAR(AVAILABLE_APS));
  buffer2send+=(PROGMEM2CHAR(CAPTION_E));
  buffer2send+=(PROGMEM2CHAR(THEAD_S));
  buffer2send+=(PROGMEM2CHAR(TR_S));
  TH_ENTRY(PROGMEM2CHAR(NUMBER_LABEL))
  TH_ENTRY(PROGMEM2CHAR(SSID_ID))
  TH_ENTRY(PROGMEM2CHAR(RSSI_NAME))
  TH_ENTRY(PROGMEM2CHAR(PROTECTED_NAME))
  buffer2send+=(PROGMEM2CHAR(TR_E));
  buffer2send+=(PROGMEM2CHAR(THEAD_E));
  buffer2send+=(PROGMEM2CHAR(TBODY_S));
  for (int i = 0; i < n; ++i)
    {
      // Print SSID and RSSI for each network found
      buffer2send+=(PROGMEM2CHAR(TR_S));
	  THR_ENTRY(String(i+1).c_str())
	  TD_ENTRY(WiFi.SSID(i))
	  stmp = String(100+WiFi.RSSI(i)) + "%";
	  TD_ENTRY(stmp.c_str())
	  TD_ENTRY((WiFi.encryptionType(i) == ENC_TYPE_NONE)?" ":"*")
    }
   //close table
   buffer2send+=(PROGMEM2CHAR(TABLE_END));
  
 
  //revert to pure softAP
   if (revertSTA) WiFi.mode(WIFI_AP);
    //ssid
   if(error_display[0]==0)
    {
		INPUT_TEXT( PROGMEM2CHAR(AP_1_ID),PROGMEM2CHAR(SSID_TITLE), PROGMEM2CHAR(SSID_ID),PROGMEM2CHAR(SSID_ID),ssid_buf)
	}
    else
    {
		INPUT_TEXT_ERROR( PROGMEM2CHAR(AP_1_ID),PROGMEM2CHAR(SSID_TITLE), PROGMEM2CHAR(SSID_ID),PROGMEM2CHAR(SSID_ID),ssid_buf)
	}
  //password 
   if(error_display[1]==0)
    {
		INPUT_PASSWORD( PROGMEM2CHAR(AP_2_ID),PROGMEM2CHAR(PASSWORD_TITLE), PROGMEM2CHAR(PASSWORD_ID),PROGMEM2CHAR(PASSWORD_NAME),password_buf)
	}
   else
    {
		INPUT_PASSWORD_ERROR( PROGMEM2CHAR(AP_2_ID),PROGMEM2CHAR(PASSWORD_TITLE), PROGMEM2CHAR(PASSWORD_ID),PROGMEM2CHAR(PASSWORD_NAME),password_buf)
	}
  //Phy mode
  SELECT_START(PROGMEM2CHAR(AP_4_ID),PROGMEM2CHAR(NETWORK_TITLE),PROGMEM2CHAR(NETWORK_ID))
  if (phy_mode_buf==PHY_MODE_11B)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(String(PHY_MODE_11B).c_str(), stmp.c_str(),PROGMEM2CHAR(VALUE_11B))
  if (phy_mode_buf==PHY_MODE_11G)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(String(PHY_MODE_11G).c_str(), stmp.c_str(),PROGMEM2CHAR(VALUE_11G))
  if (phy_mode_buf==PHY_MODE_11N)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(String(PHY_MODE_11N).c_str(), stmp.c_str(),PROGMEM2CHAR(VALUE_11N))
  SELECT_END
  //static IP ?
  if (static_ip_buf==STATIC_IP_MODE)stmp=PROGMEM2CHAR(CHECKED_VALUE);
  else stmp="";
  INPUT_CHECKBOX(PROGMEM2CHAR(STATIC_IP_NAME), PROGMEM2CHAR(STATIC_IP_LABEL),stmp.c_str())
  // if (static_ip_buf==STATIC_IP_MODE)buffer2send+=(PROGMEM2CHAR(SHOW_IP_BLOCK));
  //else buffer2send+=(PROGMEM2CHAR(HIDE_IP_BLOCK));
  //IP for static IP
   if(error_display[6]==0)
    {
		INPUT_TEXT( PROGMEM2CHAR(AP_7_ID),PROGMEM2CHAR(IP_TITLE), PROGMEM2CHAR(IP_NAME),PROGMEM2CHAR(IP_NAME),ip_buf)
	}
   else
	{
		INPUT_TEXT_ERROR( PROGMEM2CHAR(AP_7_ID),PROGMEM2CHAR(IP_TITLE), PROGMEM2CHAR(IP_NAME),PROGMEM2CHAR(IP_NAME),ip_buf)
	}
 //Gateway for static IP
   if(error_display[7]==0)
    {
		INPUT_TEXT( PROGMEM2CHAR(AP_8_ID),PROGMEM2CHAR(GATEWAY_TITLE), PROGMEM2CHAR(GATEWAY_ID),PROGMEM2CHAR(GATEWAY_NAME),gw_buf)
	}
   else
    {
		INPUT_TEXT_ERROR( PROGMEM2CHAR(AP_8_ID),PROGMEM2CHAR(GATEWAY_TITLE), PROGMEM2CHAR(GATEWAY_ID),PROGMEM2CHAR(GATEWAY_NAME),gw_buf)
	}
  //Mask for static IP
   if(error_display[8]==0)
    {
	INPUT_TEXT( PROGMEM2CHAR(AP_9_ID),PROGMEM2CHAR(SUBNET_TITLE), PROGMEM2CHAR(SUBNET_ID),PROGMEM2CHAR(SUBNET_NAME),msk_buf)
	}
   else
    {
	INPUT_TEXT_ERROR( PROGMEM2CHAR(AP_9_ID),PROGMEM2CHAR(SUBNET_TITLE), PROGMEM2CHAR(SUBNET_ID),PROGMEM2CHAR(SUBNET_NAME),msk_buf)
	}
	//buffer2send+=(PROGMEM2CHAR(DIV_E));

  
  if(msg_alert_error) 
	{
		MSG_ERROR(smsg.c_str()) 
		buffer2send+=(PROGMEM2CHAR(FORM_SUBMIT)); 
	}
  else if(msg_alert_success) 
		{
			MSG_SUCCESS(smsg.c_str()) 
		}
	else buffer2send+=(PROGMEM2CHAR(FORM_SUBMIT)); 
		
 
  buffer2send+=(PROGMEM2CHAR(FORM_END));
  buffer2send+=(PROGMEM2CHAR(PANEL_END)); 
  buffer2send+=(PROGMEM2CHAR(PAGE_BOTTOM));
  web_interface->WebServer.send(200, "text/html", buffer2send);
  if (msg_alert_success && !msg_alert_error)
	{
		system_restart();
	}
}


void handle_not_found()
{
  String IP;
  String buffer2send ="";
  if (wifi_get_opmode()==WIFI_STA ) IP=wifi_config.ip2str(WiFi.localIP());
  else IP=wifi_config.ip2str(WiFi.softAPIP());
  if (wifi_config.iweb_port!=80)
	{
		IP+=":";
		IP+=String(wifi_config.iweb_port);
	}
  buffer2send+=(PROGMEM2CHAR(T404_PAGE));
  buffer2send+=(IP.c_str());
  buffer2send+=(PROGMEM2CHAR(T404_PAGE_2));
  web_interface->WebServer.send(200, "text/html", buffer2send);
}

void handle_web_interface_printer()
{
  String IP;
  String stmp;
  String buffer2send ="";
  Serial.println("M114");
  Serial.println("M220");
  Serial.println("M221");
  //display page
  if (wifi_get_opmode()==WIFI_STA ) stmp=wifi_config.ip2str(WiFi.localIP());
  else stmp=wifi_config.ip2str(WiFi.softAPIP());
  if (wifi_config.iweb_port!=80)
	{
		stmp+=":";
		stmp+=String(wifi_config.iweb_port);
	}
  buffer2send+=(PROGMEM2CHAR(PAGE_HEAD_1));
  buffer2send+=(PROGMEM2CHAR(PAGE_HEAD_2));
  TOPBAR(stmp.c_str(),5)
  buffer2send+=(PROGMEM2CHAR(PRINTER_1a));
  buffer2send+=(PROGMEM2CHAR(PRINTER_1b));
  buffer2send+=(PROGMEM2CHAR(PRINTER_1c));
  buffer2send+=(PROGMEM2CHAR(PRINTER_1d));
  buffer2send+=(PROGMEM2CHAR(PRINTER_2));
  buffer2send+=stmp.c_str();
  buffer2send+=(PROGMEM2CHAR(PRINTER_3));
  buffer2send+=(PROGMEM2CHAR(PRINTER_4));
  buffer2send+=(PROGMEM2CHAR(PRINTER_5));
  buffer2send+=(PROGMEM2CHAR(PRINTER_6a));
  buffer2send+=(PROGMEM2CHAR(PRINTER_6b));
  buffer2send+=(PROGMEM2CHAR(PRINTER_6c));
  buffer2send+=(PROGMEM2CHAR(PRINTER_6d));
  buffer2send+=(PROGMEM2CHAR(PRINTER_7));
  buffer2send+=(PROGMEM2CHAR(PRINTER_8));
  buffer2send+=(PROGMEM2CHAR(PRINTER_9));
  buffer2send+=(PROGMEM2CHAR(PRINTER_10));
  buffer2send+=(PROGMEM2CHAR(PRINTER_11));
  buffer2send+=(PROGMEM2CHAR(PRINTER_12));
  buffer2send+=(PROGMEM2CHAR(PAGE_BOTTOM));
  web_interface->WebServer.send(200, "text/html", buffer2send);
}

void handle_web_interface_status()
{
	Serial.println("M105");
	String buffer2send =(PROGMEM2CHAR(DATA_S));
	String description;
	int temperature,target;
	if ((system_get_time()-web_interface->last_temp)<3200000)
		{
		int Tpos = web_interface->answer4M105.indexOf("T:");
		int slashpos = web_interface->answer4M105.indexOf(" /",Tpos);	
		int spacepos = web_interface->answer4M105.indexOf(" ",slashpos+1);
		if(slashpos!=-1 && spacepos!=-1 )
				{
				temperature = (int)atof(web_interface->answer4M105.substring(Tpos+2,slashpos).c_str());
				target = (int)atof(web_interface->answer4M105.substring(slashpos+2,spacepos).c_str());
				Tpos = web_interface->answer4M105.indexOf("T1:");
				if (Tpos>-1) description = "Extruder 1: ";
				else description = "Extruder : ";
				description += String(temperature);
				description += "/";
				if (target >0) description += String(target);
				else description += "off";
				TEMP_SVG(temperature,description)
				}
		//check for second extruder
		Tpos = web_interface->answer4M105.indexOf("T1:");
		if (Tpos>-1)
			{
			slashpos = web_interface->answer4M105.indexOf(" /",Tpos);
			spacepos = web_interface->answer4M105.indexOf(" ",slashpos+1);
			if(slashpos!=-1 && spacepos!=-1 )
				{
				temperature = (int)atof(web_interface->answer4M105.substring(Tpos+3,slashpos).c_str());
				target = (int)atof(web_interface->answer4M105.substring(slashpos+2,spacepos).c_str());
				description = "Extruder 2: ";
				description += String(temperature);
				description += "/";
				if (target >0) description += String(target);
				else description += "off";
				buffer2send+=(PROGMEM2CHAR(BR));
				TEMP_SVG(temperature,description)
				}
			}
		//check for bed
		Tpos = web_interface->answer4M105.indexOf("B:");
		if (Tpos>-1)
			{
			slashpos = web_interface->answer4M105.indexOf(" /",Tpos);	
			spacepos = web_interface->answer4M105.indexOf(" ",slashpos+1);
			if(slashpos!=-1 && spacepos!=-1 )
				{
				temperature = (int)atof(web_interface->answer4M105.substring(Tpos+2,slashpos).c_str());
				target = (int)atof(web_interface->answer4M105.substring(slashpos+2,spacepos).c_str());
				description = "Bed: ";
				description += String(temperature);
				description += "/";
				if (target >0) description += String(target);
				else description += "off";
				buffer2send+=(PROGMEM2CHAR(BR));
				TEMP_SVG(temperature*2,description)
				}
			}
		}
	else buffer2send += "Processing....";
	buffer2send+=(PROGMEM2CHAR(DIV_E));
	buffer2send+="<DIV NAME=\"position\" ID=\"position\">";
	int Epos = web_interface->answer4M114.indexOf("E:");
	buffer2send+=web_interface->answer4M114.substring(0,Epos);
	buffer2send+=(PROGMEM2CHAR(DIV_E));
	buffer2send+="<DIV NAME=\"speed\" ID=\"speed\">";
	buffer2send+=web_interface->answer4M220;
	buffer2send+=(PROGMEM2CHAR(DIV_E));
	buffer2send+="<DIV NAME=\"flow\" ID=\"flow\">";
	buffer2send+=web_interface->answer4M221;
	buffer2send+=(PROGMEM2CHAR(DIV_E));
	buffer2send+=(PROGMEM2CHAR(DATA_E));
	web_interface->WebServer.send(200, "text/html", buffer2send);
	
}

//URI Decoding function 
//no check if dst buffer is big enough to receive string so 
//use same size as src is a recommendation
void WEBINTERFACE_CLASS::urldecode(char *dst, const char *src)
{
  char a, b,c;
  if (dst==NULL) return;
  while (*src) {
    if ((*src == '%') &&
      ((a = src[1]) && (b = src[2])) &&
      (isxdigit(a) && isxdigit(b))) {
      if (a >= 'a')
        a -= 'a'-'A';
      if (a >= 'A')
        a -= ('A' - 10);
      else
        a -= '0';
      if (b >= 'a')
        b -= 'a'-'A';
      if (b >= 'A')
        b -= ('A' - 10);
      else
        b -= '0';
      *dst++ = 16*a+b;
      src+=3;
    } 
    else {
		c = *src++;
		if(c=='+')c=' ';
      *dst++ = c;
    }
  }
  *dst++ = '\0';
}


//constructor
WEBINTERFACE_CLASS::WEBINTERFACE_CLASS (int port):WebServer(port)
{
  //init what will handle "/"
  WebServer.on("/",HTTP_ANY, handle_web_interface_root);
  WebServer.on("/CONFIGSYS",HTTP_ANY, handle_web_interface_configSys);
  WebServer.on("/CONFIGAP",HTTP_ANY, handle_web_interface_configAP);
  WebServer.on("/CONFIGSTA",HTTP_ANY, handle_web_interface_configSTA);
  WebServer.on("/STATUS",HTTP_ANY, handle_web_interface_status);
  WebServer.on("/PRINTER",HTTP_ANY, handle_web_interface_printer);
  WebServer.onNotFound( handle_not_found);
  answer4M105="T:0 /0";
  answer4M114="";
  answer4M220="";
  answer4M221="";
  last_temp=system_get_time();
}

WEBINTERFACE_CLASS * web_interface;

